#include <iostream>
using namespace std;
/*
	테트로미노
	https://www.acmicpc.net/problem/14500

	테트로미노는 총 19가지가 있고
	하나의 테트로미노당 놓을 수 있는 방법의 개수는 약, O(NM)가지 이다.
	경우의 수가 많지 않기 때문에
	각각의 테트로미노에 대해서 모든 칸에 놓아본다.
	(1)풀이에서는 char (2)풀이는 좌표 값으로 대체 
*/
int a[500][500];
int block[19][3][2] = {
	{ { 0,1 },{ 0,2 },{ 0,3 } },
	{ { 1,0 },{ 2,0 },{ 3,0 } },
	{ { 1,0 },{ 1,1 },{ 1,2 } },
	{ { 0,1 },{ 1,0 },{ 2,0 } },
	{ { 0,1 },{ 0,2 },{ 1,2 } },
	{ { 1,0 },{ 2,0 },{ 2,-1 } },
	{ { 0,1 },{ 0,2 },{ -1,2 } },
	{ { 1,0 },{ 2,0 },{ 2,1 } },
	{ { 0,1 },{ 0,2 },{ 1,0 } },
	{ { 0,1 },{ 1,1 },{ 2,1 } },
	{ { 0,1 },{ 1,0 },{ 1,1 } },
	{ { 0,1 },{ -1,1 },{ -1,2 } },
	{ { 1,0 },{ 1,1 },{ 2,1 } },
	{ { 0,1 },{ 1,1 },{ 1,2 } },
	{ { 1,0 },{ 1,-1 },{ 2,-1 } },
	{ { 0,1 },{ 0,2 },{ -1,1 } },
	{ { 0,1 },{ 0,2 },{ 1,1 } },
	{ { 1,0 },{ 2,0 },{ 1,1 } },
	{ { 1,0 },{ 2,0 },{ 1,-1 } },
};
int main() {
	int n, m;
	cin >> n >> m;
	for (int i = 0; i<n; i++) {
		for (int j = 0; j<m; j++) {
			cin >> a[i][j];
		}
	}
	int ans = 0;
	for (int i = 0; i<n; i++) {
		for (int j = 0; j<m; j++) {
			for (int k = 0; k<19; k++) {
				bool ok = true;
				int sum = a[i][j];
				for (int l = 0; l<3; l++) {
					int x = i + block[k][l][0];
					int y = j + block[k][l][1];
					if (0 <= x && x < n && 0 <= y && y < m) {
						sum += a[x][y];
					}
					else {
						ok = false;
						break;
					}
				}
				if (ok && ans < sum) {
					ans = sum;
				}
			}
		}
	}
	cout << ans << '\n';
	return 0;
}